<a href="https://colab.research.google.com/github/oliviangugi/30DayChallenge/blob/main/Olivia30DAYChallengepynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 777.2 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [2]:
%load_ext sql

New data base ABC_DATA Week 1 day 1 and 2

In [3]:
%sql sqlite:///ABC_DATA.db

In [4]:
%%sql CREATE TABLE Customers(customer_id VARCHAR(25), first_name VARCHAR(25), last_name VARCHAR(25), email VARCHAR(25));

 * sqlite:///ABC_DATA.db
Done.

[]

In [5]:
%%sql CREATE TABLE Products(product_id INT(10), product_name VARCHAR(25), price DECIMAL(10,2));

 * sqlite:///ABC_DATA.db
Done.

[]

In [6]:
%%sql CREATE TABLE Orders(order_id INT(10), cutomer_id INT(10), order_date "YYYY-MM-DD");

 * sqlite:///ABC_DATA.db
Done.

[]

In [7]:
%sql DROP TABLE Orders;

 * sqlite:///ABC_DATA.db
Done.

[]

In [8]:

%%sql CREATE TABLE Orders(order_id INT(10), customer_id INT(10), order_date 'YYYY,MM,DD');

 * sqlite:///ABC_DATA.db
Done.

[]

In [9]:
%%sql CREATE TABLE Order_items(oder_id INT(10), product_id INT(10) PRIMARY KEY, qualtity INT(10));

 * sqlite:///ABC_DATA.db
Done.

[]

In [10]:
%%sql DROP TABLE Order_items;

 * sqlite:///ABC_DATA.db
Done.

[]

In [11]:
%%sql CREATE TABLE Order_item(order_id INT(10), product_id INT(10), quantity INT(10));

 * sqlite:///ABC_DATA.db
Done.

[]

DAY 3 CHALLENGE. Populate VALUES into each table using INSERT INTO command

In [12]:
%%sql INSERT INTO Customers(customer_id, first_name, last_name, email) VALUES
 (1, 'John', 'Doe', 'johndoe@email.com'),
    (2,'Jane', 'Smith', 'janesmith@email.com'),
    (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
    (4, 'Alice', 'Brown', 'alicebrown@email.com'),
    (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
    (6, 'Eva','Fisher', 'evafisher@email.com'),
    (7, 'George','Harris', 'georgeharris@email.com'),
    (8, 'Ivy', 'Johnes', 'ivyjones@email.com'),
    (9, 'kevin', 'Miller', 'kevinmiller@email.com'),
    (10, 'Lilly', 'Nelson', 'lillynelson@email.com'),
    (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
    (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
    (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [13]:
%sql PRAGMA table_info ('Customers');

 * sqlite:///ABC_DATA.db
Done.

[(0, 'customer_id', 'VARCHAR(25)', 0, None, 0),
 (1, 'first_name', 'VARCHAR(25)', 0, None, 0),
 (2, 'last_name', 'VARCHAR(25)', 0, None, 0),
 (3, 'email', 'VARCHAR(25)', 0, None, 0)]

In [14]:
%%sql INSERT INTO Products(product_id, product_name, price) VALUES
(1, 'Product A', 10.00),
    (2, 'Product B', 15.00),
    (3, 'Product C', 20.00),
    (4, 'Product D', 25.00),
    (5, 'Product E', 30.00),
    (6, 'Product F', 35.00),
    (7, 'Product G', 40.00),
    (8, 'Product H', 45.00),
    (9, 'Product I', 50.00),
    (10, 'Product J', 55.00),
    (11, 'Product K', 60.00),
    (12, 'Product L', 65.00),
    (13, 'Product M', 70.00);

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [19]:
%%sql INSERT INTO orders (order_id, customer_id, order_date) VALUES
  (1, 1, '2023-05-01'),
    (2, 2, '2023-05-02'),
    (3, 3, '2023-05-03'),
    (4, 1, '2023-05-04'),
    (5, 2, '2023-05-05'),
    (6, 3, '2023-05-06'),
    (7, 4, '2023-05-07'),
    (8, 5, '2023-05-08'),
    (9, 6, '2023-05-09'),
    (10, 7, '2023-05-10'),
    (11, 8, '2023-05-11'),
    (12, 9, '2023-05-12'),
    (13, 10, '2023-05-13'),
    (14, 11, '2023-05-14'),
    (15, 12, '2023-05-15'),
    (16, 13, '2023-05-16');

 * sqlite:///ABC_DATA.db
16 rows affected.

[]

In [22]:
%%sql INSERT INTO Order_item (order_id, product_id, quantity) VALUES
(1, 1, 2),
    (1, 2, 1),
    (2, 2, 1),
    (2, 3, 3),
    (3, 1, 1),
    (3, 3, 2),
    (4, 2, 4),
    (4, 3, 1),
    (5, 1, 1),
    (5, 3, 2),
    (6, 2, 3),
    (6, 1, 1),
    (7, 4, 1),
    (7, 5, 2),
    (8, 6, 3),
    (8, 7, 1),
    (9, 8, 2),
    (9, 9, 1),
    (10, 10, 3),
    (10, 11, 2),
    (11, 12, 1),
    (11, 13, 3),
    (12, 4, 2),
    (12, 5, 1),
    (13, 6, 3),
    (13, 7, 2),
    (14, 8, 1),
    (14, 9, 2),
    (15, 10, 3),
    (15, 11, 1),
    (16, 12, 2),
    (16, 13, 3);

 * sqlite:///ABC_DATA.db
32 rows affected.

[]

In [23]:
%sql PRAGMA table_info ('Order_item');

 * sqlite:///ABC_DATA.db
Done.

[(0, 'order_id', 'INT(10)', 0, None, 0),
 (1, 'product_id', 'INT(10)', 0, None, 0),
 (2, 'quantity', 'INT(10)', 0, None, 0)]

WEEK 2 PROJECT

1.Which product has the highest price? Only return a single row.

In [24]:
%sql SELECT MAX (price) FROM Products;

 * sqlite:///ABC_DATA.db
Done.

[(70,)]

In [35]:
%sql SELECT product_id, product_name FROM Products WHERE price="70"

 * sqlite:///ABC_DATA.db
Done.

[(13, 'Product M')]

2.Which order_id had the highest number of items in terms of quantity

In [38]:
%sql SELECT MAX(quantity) FROM Order_item;

 * sqlite:///ABC_DATA.db
Done.

[(4,)]

2b.Which order_id had the highest number of items in terms of quantity

In [39]:
%sql SELECT MAX(order_id) FROM Orders;

 * sqlite:///ABC_DATA.db
Done.

[(16,)]

DAY 4 CHALLENGE

1. Which customer has made the most orders?

In [56]:
%sql SELECT order_counts as(
SELECT customer_id,count(order_id) AS order_count
  FROM Orders
  GROUP BY customer_id),
  max_order_count AS(
  SELECT max(order_count) as max_count
  FROM Order_item)
  SELECT Customer.first_name, Customer.last_name
  FROM Customers
  JOIN order_counts oc ON c.customer_id = oc.customer_id
  JOIN max_order_count moc ON oc.order_count = moc.max_count;

SyntaxError: unmatched ')' (<ipython-input-56-aa2dd8d3bebb>, line 4)

2. What’s the total revenue per product?

In [51]:
%sql SELECT product.product_name,
p.price * sum(oi.quantity) AS total_revenue
FROM Producs
JOIN order_items oi ON oi.product_id = p.product_id
GROUP BY price p.product_id, p.product_name,
ORDER BY 2 desc;

SyntaxError: invalid syntax (<ipython-input-51-f272261fb2a1>, line 2)

DAY 5 CHALLENGE

1.Which customer has made the most orders?

In [54]:
%sql SELECT order_counts as (
SELECT customer_id, count(order_id) AS order_count
FROM Orders
GROUP BY customer_id),
max_order_count AS (
SELECT max(order_count) as max_count
FROM Order_item )
SELECT c.first_name, c.last_name
FROM Customers
JOIN order_counts oc ON c.customer_id = oc.customer_id
JOIN max_order_count moc ON oc.order_count = moc.max_count;

SyntaxError: unmatched ')' (<ipython-input-54-e85075a454e3>, line 4)